event/app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("date", "categories", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "2021-12-31"], ["categories", "\"\\\"VIP\\\":2000, \\\"FAN\\\":1000\""], ["created_at", "2021-11-11 10:36:02.312691"], ["updated_at", "2021-11-11 10:36:02.312691"]]
---
  def show
    #render json: Event.find(params[:id])

    @event = Event.find(params[:id])

    hash = {
      "event_id": @event.id,
      "date": @event.date,
      "categories": @event.categories,
      "created_at": @event.created_at,
    }

INSERT INTO "events" ("date", "categories", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create

    #{"VIP" : { "all":100, "sold":10, "basic_price":2000}, "SUPERVIP" : { "all":20, "sold":5, "basic_price":5000}}

    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "categories" = ?, "updated_at" = ? WHERE "events"."id" = ?
---
  def update

    #@event.date = Event.find_by_id(params[:date])
    #@event.categories = Event.find_by_id(params[:categories])
    #render :show, status: :ok, location: @event

    respond_to do |format|
      if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy

    begin
      @event = Event.find_by_id(params[:id])